# GetSeverity Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessageAccessor..::..GetSeverity Method
FailureMessageAccessor Class See Also
---
Retrieves the severity of the failure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureSeverity GetSeverity()
```

Visual Basic
---
```text
Public Function GetSeverity As FailureSeverity
```

Visual C++
---
```text
public:
FailureSeverity GetSeverity()
```

# ### Return Value
The severity of the failure.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

# See Also
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace